{"keras_version": "2.0.4", "config": [{"config": {"data_format": "channels_first", "strides": [1, 1], "use_bias": true, "name": "conv2d_1", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "filters": 80, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 1, 120, 100], "dilation_rate": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_1", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [3, 3], "data_format": "channels_first", "strides": [3, 3], "name": "max_pooling2d_1", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_first", "strides": [1, 1], "use_bias": true, "name": "conv2d_2", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "padding": "valid", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "filters": 160, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_2", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [3, 3], "data_format": "channels_first", "strides": [3, 3], "name": "max_pooling2d_2", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_first", "strides": [1, 1], "use_bias": true, "name": "conv2d_3", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "padding": "valid", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "filters": 240, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_3", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [3, 3], "data_format": "channels_first", "strides": [3, 3], "name": "max_pooling2d_3", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"rate": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 3, "use_bias": true, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "theano"}