{"class_name": "Sequential", "backend": "theano", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "scale": 2.0, "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "batch_input_shape": [null, 1, 80, 100], "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "filters": 80, "activation": "linear", "bias_regularizer": null, "padding": "valid", "dilation_rate": [1, 1]}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [3, 3], "strides": [3, 3], "padding": "valid", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "scale": 2.0, "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "filters": 160, "activation": "linear", "bias_regularizer": null, "padding": "valid", "dilation_rate": [1, 1]}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [3, 3], "strides": [3, 3], "padding": "valid", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "scale": 2.0, "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "filters": 240, "activation": "linear", "bias_regularizer": null, "padding": "valid", "dilation_rate": [1, 1]}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "pool_size": [3, 3], "strides": [3, 3], "padding": "valid", "data_format": "channels_first"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "scale": 2.0, "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "units": 16, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "keras_version": "2.0.4"}