{"class_name": "Sequential", "backend": "theano", "keras_version": "2.0.4", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "batch_input_shape": [null, 1, 120, 100], "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_1", "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "padding": "valid"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "alpha": 0.30000001192092896, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [3, 3], "strides": [3, 3], "trainable": true, "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"filters": 160, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_2", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "padding": "valid"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "alpha": 0.30000001192092896, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [3, 3], "strides": [3, 3], "trainable": true, "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"filters": 240, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_3", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "padding": "valid"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "alpha": 0.30000001192092896, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "pool_size": [3, 3], "strides": [3, 3], "trainable": true, "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_constraint": null, "trainable": true, "use_bias": true, "units": 3}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}]}