{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "use_bias": true, "kernel_size": [3, 3], "batch_input_shape": [null, 1, 120, 100], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "activity_regularizer": null, "dtype": "float32", "data_format": "channels_first", "trainable": true, "strides": [1, 1], "bias_constraint": null, "filters": 80, "dilation_rate": [1, 1], "name": "conv2d_1", "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "padding": "valid", "data_format": "channels_first", "strides": [3, 3], "name": "max_pooling2d_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "filters": 160, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_first", "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "padding": "valid", "data_format": "channels_first", "strides": [3, 3], "name": "max_pooling2d_2", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "filters": 240, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_first", "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "padding": "valid", "data_format": "channels_first", "strides": [3, 3], "name": "max_pooling2d_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "activity_regularizer": null, "trainable": true, "units": 3, "use_bias": true, "name": "dense_1", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "keras_version": "2.0.4", "backend": "theano"}