{"config": [{"config": {"name": "conv2d_10", "activation": "linear", "batch_input_shape": [null, 1, 80, 100], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "dtype": "float32", "dilation_rate": [1, 1], "filters": 80, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "uniform", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "strides": [1, 1], "trainable": true, "use_bias": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_10", "alpha": 0.30000001192092896, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"name": "max_pooling2d_10", "trainable": true, "padding": "valid", "strides": [3, 3], "data_format": "channels_first", "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_11", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "trainable": true, "filters": 160, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "uniform", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "strides": [1, 1], "bias_constraint": null, "use_bias": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_11", "alpha": 0.30000001192092896, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"name": "max_pooling2d_11", "trainable": true, "padding": "valid", "strides": [3, 3], "data_format": "channels_first", "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_12", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "trainable": true, "filters": 240, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "uniform", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "strides": [1, 1], "bias_constraint": null, "use_bias": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_12", "alpha": 0.30000001192092896, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"name": "max_pooling2d_12", "trainable": true, "padding": "valid", "strides": [3, 3], "data_format": "channels_first", "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_4", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_4", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_4", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "uniform", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "units": 2, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.4", "class_name": "Sequential", "backend": "theano"}